import logging
from datetime import time
from bot.utils.quran import QuranManager

logger = logging.getLogger(__name__)

TOTAL_QURAN_VERSES = 6236

DEFAULT_SEPAS_TEXTS = [
    "خدا گره از کارتان باز کند ان شاءالله",
    "فقط حیدر امیرالمؤمنین است",
    "حاجت روا ان شاءالله",
    "یاعلی مددی",
    "به عشق دیدار مهدی",
    "اللهم ارزقنا توفیق الشهادة",
    "منور به نور مولا باشید",
    "خدا قلبتان را محل نظر مولا قرار دهد"
    "ایمانتان قوی",
    "صلی الله علیک یا اباعبدالله الحسین",
    "یاصاحب الزمان ادرکنی",
    "اللهم عجل لولیک الفرج به حق زینب کبری",
    "الحق مع علی",
    "یار صاحب الزمان شوید",
    "اللهم الرزقنا توفیق الشهاده",
    "السلام علیک یا اهل بیت النبوه",
    "روزق وروزی با برکت نصیب شما",
    "اللهم بارک لمولانا صاحب الزمان",
    "آزادی زندانیان بی گناه",
    "الهی و ربی من لی غیرک",
    "فرزند صالح نصیبتون",
    "یا عالی به حق علی عجل لولیک الفرج",
    "یا مولا یا صاحب الزمان ادرکنی",
    "فقط حیدر امیر المومنین است",
    "توفیق رفتن بین الحرمین"
]

DEFAULT_COMPLETION_MESSAGE = "دوره ختم به پایان رسید! 🌸"

KHATM_TYPES = ["salavat", "zekr", "ghoran"]


DEFAULT_MAX_NUMBER = 100000000000  

DAILY_HADITH_TIME = time(hour=8, minute=0)
DAILY_RESET_TIME = time(hour=0, minute=0)
DAILY_PERIOD_RESET_TIME = time(hour=0, minute=5)
MIN_DELETE_MINUTES = 1
MAX_DELETE_MINUTES = 1440
HADITH_CLEAN_PATTERNS = [
    r'@[A-Za-z0-9_]+',
    r'(?:http[s]?://|t.me/)[^\s]+'
]

MAIN_GROUP_ID = -100123456789
MAX_MESSAGE_LENGTH = 4096
TAG_COOLDOWN_HOURS = 24
TAG_MESSAGE_DELAY = 2



SUPER_ADMIN_IDS = [1717599240, 987654321]  

MONITOR_CHANNEL_ID = -1001376986581
